test/report/dot/module-level/__fixtures__/clusterless.dot
strict digraph "dependency-cruiser output"{




    "fs" [label=<fs> tooltip="fs" ]
    "http" [label=<http> tooltip="http" ]
    subgraph "cluster_node_modules" {label="node_modules" subgraph "cluster_node_modules/somemodule" {label="somemodule" subgraph "cluster_node_modules/somemodule/node_modules" {label="node_modules" subgraph "cluster_node_modules/somemodule/node_modules/someothermodule" {label="someothermodule" "node_modules/somemodule/node_modules/someothermodule/main.js" [label=<main.js> tooltip="main.js" URL="node_modules/somemodule/node_modules/someothermodule/main.js" ] } } } }
    subgraph "cluster_node_modules" {label="node_modules" subgraph "cluster_node_modules/somemodule" {label="somemodule" subgraph "cluster_node_modules/somemodule/src" {label="src" "node_modules/somemodule/src/moar-javascript.js" [label=<moar-javascript.js> tooltip="moar-javascript.js" URL="node_modules/somemodule/src/moar-javascript.js" ] } } }
    subgraph "cluster_node_modules" {label="node_modules" subgraph "cluster_node_modules/somemodule" {label="somemodule" subgraph "cluster_node_modules/somemodule/src" {label="src" "node_modules/somemodule/src/somemodule.js" [label=<somemodule.js> tooltip="somemodule.js" URL="node_modules/somemodule/src/somemodule.js" ] } } }
    "node_modules/somemodule/src/somemodule.js" -> "node_modules/somemodule/src/moar-javascript.js" [xlabel="unnamed" tooltip="unnamed" ]
    "node_modules/somemodule/src/somemodule.js" -> "node_modules/somemodule/node_modules/someothermodule/main.js" [xlabel="unnamed" tooltip="unnamed" ]
    "one_only_one.js" [label=<one_only_one.js> tooltip="one_only_one.js" URL="one_only_one.js" ]
    "one_only_one.js" -> "path" [xlabel="unnamed" tooltip="unnamed" ]
    "one_only_two.js" [label=<one_only_two.js> tooltip="one_only_two.js" URL="one_only_two.js" ]
    "one_only_two.js" -> "path" [xlabel="unnamed" tooltip="unnamed" ]
    "path" [label=<path> tooltip="path" ]
    "root_one.js" [label=<root_one.js> tooltip="root_one.js" URL="root_one.js" ]
    "root_one.js" -> "one_only_one.js" [xlabel="unnamed" tooltip="unnamed" ]
    "root_one.js" -> "one_only_two.js" [xlabel="unnamed" tooltip="unnamed" ]
    "root_one.js" -> "shared.js" [xlabel="unnamed" tooltip="unnamed" ]
    "root_one.js" -> "sub/dir.js" [xlabel="unnamed" tooltip="unnamed" ]
    "root_one.js" -> "fs" [xlabel="unnamed" tooltip="unnamed" ]
    "root_one.js" -> "node_modules/somemodule/src/somemodule.js" [xlabel="unnamed" tooltip="unnamed" ]
    "root_two.js" [label=<root_two.js> tooltip="root_two.js" URL="root_two.js" ]
    "root_two.js" -> "shared.js" [xlabel="unnamed" tooltip="unnamed" ]
    "root_two.js" -> "somedata.json" [xlabel="unnamed" tooltip="unnamed" ]
    "root_two.js" -> "two_only_one.js" [xlabel="unnamed" tooltip="unnamed" ]
    "root_two.js" -> "http" [xlabel="unnamed" tooltip="unnamed" ]
    "shared.js" [label=<shared.js> tooltip="shared.js" ]
    "shared.js" -> "path" [xlabel="unnamed" tooltip="unnamed" ]
    "somedata.json" [label=<somedata.json> tooltip="somedata.json" URL="somedata.json" ]
    subgraph "cluster_sub" {label="sub" "sub/depindir.js" [label=<depindir.js> tooltip="depindir.js" URL="sub/depindir.js" ] }
    "sub/depindir.js" -> "path" [xlabel="unnamed" tooltip="unnamed" ]
    subgraph "cluster_sub" {label="sub" "sub/dir.js" [label=<dir.js> tooltip="dir.js" URL="sub/dir.js" ] }
    "sub/dir.js" -> "sub/depindir.js" [xlabel="unnamed" tooltip="unnamed" ]
    "sub/dir.js" -> "path" [xlabel="unnamed" tooltip="unnamed" ]
    "two_only_one.js" [label=<two_only_one.js> tooltip="two_only_one.js" URL="two_only_one.js" ]
    "two_only_one.js" -> "sub/dir.js" [xlabel="unnamed" tooltip="unnamed" ]
}
